<?php
class model_engineering_serviceIncome_income extends model_base {
	function __construct(){
		$this->tbl_name = "oa_contract_service_income";
		$this->sql_map = "engineering/serviceIncome/incomeSql.php";
		parent::__construct();
	}


/****************************************************以下是模板调用显示方法***************************************************/



/****************************************************以上是模板调用显示****************************************************/

/****************************************************以下是外部接口类方法****************************************************/


/****************************************************以下是外部接口类方法****************************************************/
}
?>
