<?php
class model_engineering_servicelicense_servicelicense extends model_base {
	function __construct(){
		$this->tbl_name = "oa_contract_service_license";
		$this->sql_map = "engineering/servicelicense/servicelicenseSql.php";
		parent::__construct();
	}


/****************************************************以下是模板调用显示方法***************************************************/



/****************************************************以上是模板调用显示****************************************************/

/****************************************************以下是外部接口类方法****************************************************/


/****************************************************以下是外部接口类方法****************************************************/
}
?>
